# Проект FitLife - MVP версия 1.0

# AI-log
# Использовал ChatGPT как помощника при выполнении проекта.
# Задавал вопросы по input(), int(), float(), round(), f-строкам и \n,
# а также по оформлению и переносу длинного print() на несколько строк.
# Использовал ИИ для объяснения возникающих ошибок и проверки соответствия
# проекта требованиям задания.
# Использовал ИИ для разбора замечаний Flake8 и понимания результатов pytest.
# Код и логику программы написал самостоятельно,
# используя подсказки и объяснения ИИ.

# 1. Знакомство
print('Доброго времени суток')
user_name = input('Введите ваше имя\n')  # узнаём имя пользователя
user_age = int(input('Введите ваш возраст\n'))  # узнаём возраст пользователя


# 2. Сбор данных
user_weight = float(input('Введите ваш вес (в кг)\n'))
# узнаём вес пользователя
user_height = float(input('Введите ваш рост (в метрах например, 1.75)\n'))
# узнаём рост пользователя


# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
bmi = round(user_weight / (user_height ** 2), 1)  # рассчитываем ИМТ

# Подсчет воды: вес * 30 мл
water_ml = user_weight * 30  # рассчитываем норму воды
water_l = round(water_ml / 1000, 1)


# 4. Вывод красивого результата
print(
    f'Отчет для пользователя: {user_name} ({user_age} г.)\n'
    f'Ваш индекс массы тела: {bmi}\n'
    f'Рекомендуемая норма воды: {water_l}л. в день')
print("Расчет окончен. Будьте здоровы!(^ ω ^)")
