# Проект FitLife - MVP версия 1.0

# AI-log
# Использовал ChatGPT как помощника при выполнении проекта.
# Задавал вопросы по input(), int(), float(), round(), f-строкам и \n,
# а также по оформлению и переносу длинного print() на несколько строк.
# Использовал ИИ для объяснения возникающих ошибок и проверки соответствия
# проекта требованиям задания.
# Использовал ИИ для разбора замечаний Flake8 и понимания результатов pytest.
# Код и логику программы написал самостоятельно,
# используя подсказки и объяснения ИИ.
WATER_PER_KG = 30
ML_PER_LITER = 1000

# 1. Знакомство
print('Доброго времени суток')
while True:
    user_name = input('Введите ваше имя\n').strip()
    if user_name == '':
        print('Ошибка: вы ничего не ввели')
    else:
        break

while True:  # получаем возраст пользователя и проверяем корректность ввода
    try:
        user_age = int(input('Введите ваш возраст\n'))
        if user_age < 0:
            print(
                'Некорректно введён возраст.'
                'Возраст не должен быть отрицательным',
            )
        else:
            break
    except ValueError:
        print('Ошибка: введите число')


# 2. Сбор данных
while True:  # узнаём вес пользователя и проверяем корректность ввода
    try:
        user_weight = float(input('Введите ваш вес (в кг, например, 65 кг)\n'))
        if user_weight < 0:
            print('Некорректно введён вес. Вес не должен быть отрицательным.')
        else:
            break
    except ValueError:
        print('Ошибка: введите число')

while True:  # узнаём рост пользователя и проверяем корректность ввода
    try:
        user_height = float(
            input('Введите ваш рост (в метрах, например, 1.75)\n'))
        if user_height <= 0:
            print('Некорректно введён рост. Рост должен быть больше нуля')
        else:
            break
    except ValueError:
        print('Ошибка: введите число')

# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
bmi = round(user_weight / (user_height ** 2), 1)  # рассчитываем ИМТ
water_l = round((user_weight * WATER_PER_KG) / ML_PER_LITER, 1)


# 4. Вывод красивого результата
print(
    f'Отчет для пользователя: {user_name} ({user_age} г.)\n'
    f'Ваш индекс массы тела: {bmi}\n'
    f'Рекомендуемая норма воды: {water_l}л. в день')
print("Расчёт окончен. Будьте здоровы! (^ ω ^)")
